app/views/users/show.html.erb

SELECT "friendships".* FROM "friendships" ORDER BY id DESC LIMIT 15
SELECT 1 FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = 2 AND "users"."id" = 3 LIMIT 1
---
<ul class="unstyled">
  <% Friendship.last(15).each do |f| %>
    <li><span style="color: #cccccc;"><%= f.created_at %></span> <%= User.find(f.user_id).name + " est connecté à " + User.find(f.friend_id).name %></li>