app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("created_at", "friend_id", "is_valided", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 01 Feb 2012 16:46:59 UTC +00:00], ["friend_id", 4], ["is_valided", false], ["updated_at", Wed, 01 Feb 2012 16:46:59 UTC +00:00], ["user_id", 5]]
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    @friendship.is_valided = false

    respond_to do |format|
      if @friendship.save