app/controllers/users_controller.rb

  def destroy
    if @user = User.find_by_id(params[:id])
      @user.delete
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = 1